{
  "Conditions": {
    "AgentIdRiskLevels": null,
    "Applications": {
      "ApplicationFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeApplications": [],
      "GlobalSecureAccess": {},
      "IncludeApplications": [
        "578f24e9-1ee3-4d7c-a3bb-015dfbecc8cb",
        "cc15fd57-2c6c-4117-a88c-83b1d56b4bbe"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": [],
      "NetworkAccess": {}
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "AgentIdServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeAgentIdServicePrincipals": null,
      "ExcludeServicePrincipals": null,
      "IncludeAgentIdServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": "all"
        },
        "GuestOrExternalUserTypes": "b2bDirectConnectUser"
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [
        "08601fbc-80c7-4f07-8d5a-3e899b0fd0b4",
        "ac62159a-48cd-42fa-a6d7-520d47ee1973"
      ],
      "IncludeGroups": [],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": [
        "All"
      ]
    }
  },
  "CreatedDateTime": "2022-03-21T17:57:45.3289554Z",
  "DeletedDateTime": null,
  "Description": null,
  "DisplayName": "500A - TermsOfUse - Default",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": [
      "2d376092-0987-4acc-9aaf-704a758e150b"
    ]
  },
  "Id": "8f96918b-15d2-4451-bed3-eb71ddfb98e3",
  "ModifiedDateTime": "2025-12-03T18:36:37.3717299Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "GlobalSecureAccessFilteringProfile": {
      "IsEnabled": null,
      "ProfileId": null
    },
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": "primaryAndSecondaryAuthentication",
      "FrequencyInterval": "everyTime",
      "IsEnabled": true,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabledForReportingButNotEnforced",
  "AdditionalProperties": {}
}
