{
  "Conditions": {
    "AgentIdRiskLevels": null,
    "Applications": {
      "ApplicationFilter": {
        "Mode": "include",
        "Rule": "CustomSecurityAttribute.TrustedLevel_Authentication -eq \"Auth4\""
      },
      "ExcludeApplications": [],
      "GlobalSecureAccess": {},
      "IncludeApplications": [],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": [],
      "NetworkAccess": {}
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "AgentIdServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeAgentIdServicePrincipals": null,
      "ExcludeServicePrincipals": null,
      "IncludeAgentIdServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [
        "232a1f8d-92bf-4575-8cf7-390d5fe8fa20"
      ],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": []
    }
  },
  "CreatedDateTime": "2025-10-27T19:27:08.6333202Z",
  "DeletedDateTime": null,
  "Description": null,
  "DisplayName": "710A - ID4 - AU4 - AllAppsWithMFA",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": [
        "fido2",
        "temporaryAccessPassOneTime"
      ],
      "CombinationConfigurations": [
        {
          "AppliesToCombinations": [
            "fido2"
          ],
          "Id": "4976eb68-5486-44f4-90a4-de0b6545b347"
        }
      ],
      "CreatedDateTime": "2023-03-29T15:43:00.9062006Z",
      "Description": "",
      "DisplayName": "FIDO2 + TAP",
      "Id": "113e9a70-7f24-4c01-9a21-ef467b2fe53e",
      "ModifiedDateTime": "2025-09-04T17:46:17.7237433Z",
      "PolicyType": "custom",
      "RequirementsSatisfied": "mfa"
    },
    "BuiltInControls": [],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "5509c7e0-05d7-449a-bea3-5622c6ce10ed",
  "ModifiedDateTime": "2025-12-03T18:37:59.8952748Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "GlobalSecureAccessFilteringProfile": {
      "IsEnabled": null,
      "ProfileId": null
    },
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabledForReportingButNotEnforced",
  "AdditionalProperties": {}
}
