{
  "conditions": {
    "applications": {
      "applicationFilter": {
        "mode": null,
        "rule": null
      },
      "excludeApplications": [],
      "includeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [
        "urn:user:registerdevice"
      ]
    },
    "authenticationFlows": {
      "transferMethods": null
    },
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": {
      "excludeServicePrincipals": null,
      "includeServicePrincipals": null,
      "servicePrincipalFilter": {
        "mode": null,
        "rule": null
      }
    },
    "devices": {
      "deviceFilter": {
        "mode": null,
        "rule": null
      }
    },
    "insiderRiskLevels": null,
    "locations": {
      "excludeLocations": null,
      "includeLocations": null
    },
    "platforms": {
      "excludePlatforms": null,
      "includePlatforms": null
    },
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "P000"
      ],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "createdDateTime": "2025-07-31T23:48:18.5305469Z",
  "description": null,
  "displayName": "016A-Global-AttackSurfaceReduction-MFAforDeviceJoin",
  "grantControls": {
    "authenticationStrength": {
      "allowedCombinations": null,
      "combinationConfigurations": null,
      "createdDateTime": null,
      "description": null,
      "displayName": null,
      "id": null,
      "modifiedDateTime": null,
      "policyType": null,
      "requirementsSatisfied": null
    },
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "id": "f1814871-a95d-4bc2-b552-d107c0c3ea1b",
  "modifiedDateTime": "2025-07-31T23:48:47.0032615Z",
  "sessionControls": {
    "applicationEnforcedRestrictions": {
      "isEnabled": null
    },
    "cloudAppSecurity": {
      "cloudAppSecurityType": null,
      "isEnabled": null
    },
    "disableResilienceDefaults": null,
    "persistentBrowser": {
      "isEnabled": null,
      "mode": null
    },
    "signInFrequency": {
      "authenticationType": null,
      "frequencyInterval": null,
      "isEnabled": null,
      "type": null,
      "value": null
    }
  },
  "state": "enabledForReportingButNotEnforced",
  "templateId": null,
  "additionalProperties": {}
}
