{
  "conditions": {
    "applications": {
      "applicationFilter": {
        "mode": null,
        "rule": null
      },
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "authenticationFlows": {
      "transferMethods": "authenticationTransfer"
    },
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": {
      "excludeServicePrincipals": null,
      "includeServicePrincipals": null,
      "servicePrincipalFilter": {
        "mode": null,
        "rule": null
      }
    },
    "devices": {
      "deviceFilter": {
        "mode": null,
        "rule": null
      }
    },
    "insiderRiskLevels": null,
    "locations": {
      "excludeLocations": null,
      "includeLocations": null
    },
    "platforms": {
      "excludePlatforms": null,
      "includePlatforms": null
    },
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "P000",
        "E014"
      ],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "createdDateTime": "2025-07-31T21:32:56.900322Z",
  "description": null,
  "displayName": "014B-Global-ReductionSurfaceAttaque-ToutesRessources-BloquerFluxTransfertAuth",
  "grantControls": {
    "authenticationStrength": {
      "allowedCombinations": null,
      "combinationConfigurations": null,
      "createdDateTime": null,
      "description": null,
      "displayName": null,
      "id": null,
      "modifiedDateTime": null,
      "policyType": null,
      "requirementsSatisfied": null
    },
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "id": "bd79f42c-9c7d-487a-8037-97ddba946b82",
  "modifiedDateTime": null,
  "sessionControls": {
    "applicationEnforcedRestrictions": {
      "isEnabled": null
    },
    "cloudAppSecurity": {
      "cloudAppSecurityType": null,
      "isEnabled": null
    },
    "disableResilienceDefaults": null,
    "persistentBrowser": {
      "isEnabled": null,
      "mode": null
    },
    "signInFrequency": {
      "authenticationType": null,
      "frequencyInterval": null,
      "isEnabled": null,
      "type": null,
      "value": null
    }
  },
  "state": "enabledForReportingButNotEnforced",
  "templateId": null,
  "additionalProperties": {}
}
