{
  "conditions": {
    "applications": {
      "applicationFilter": {
        "mode": null,
        "rule": null
      },
      "excludeApplications": [],
      "includeApplications": [
        "Office365"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": null,
    "clientApplications": {
      "excludeServicePrincipals": null,
      "includeServicePrincipals": null,
      "servicePrincipalFilter": {
        "mode": null,
        "rule": null
      }
    },
    "devices": {
      "deviceFilter": {
        "mode": null,
        "rule": null
      }
    },
    "locations": {
      "excludeLocations": null,
      "includeLocations": null
    },
    "platforms": {
      "excludePlatforms": null,
      "includePlatforms": null
    },
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "P000",
        "E231"
      ],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [
        "P200"
      ],
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "includeRoles": [],
      "includeUsers": []
    }
  },
  "description": null,
  "displayName": "231A-Internes-ProtectionDonneesetApps-AppsSpecifiques-ToutesPlateformes-MFA",
  "grantControls": {
    "authenticationStrength": {
      "allowedCombinations": null,
      "combinationConfigurations": null,
      "createdDateTime": null,
      "description": null,
      "displayName": null,
      "id": null,
      "modifiedDateTime": null,
      "policyType": null,
      "requirementsSatisfied": null
    },
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "modifiedDateTime": "2026-02-26T00:00:00Z",
  "sessionControls": {
    "applicationEnforcedRestrictions": {
      "isEnabled": null
    },
    "cloudAppSecurity": {
      "cloudAppSecurityType": null,
      "isEnabled": null
    },
    "disableResilienceDefaults": null,
    "persistentBrowser": {
      "isEnabled": null,
      "mode": null
    },
    "signInFrequency": {
      "authenticationType": null,
      "frequencyInterval": null,
      "isEnabled": null,
      "type": null,
      "value": null
    }
  },
  "state": "enabledForReportingButNotEnforced"
}
