{
  "conditions": {
    "applications": {
      "applicationFilter": {
        "mode": null,
        "rule": null
      },
      "excludeApplications": [],
      "includeApplications": [
        "None"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": {
      "excludeServicePrincipals": null,
      "includeServicePrincipals": null,
      "servicePrincipalFilter": {
        "mode": null,
        "rule": null
      }
    },
    "devices": {
      "deviceFilter": {
        "mode": null,
        "rule": null
      }
    },
    "locations": {
      "excludeLocations": null,
      "includeLocations": null
    },
    "platforms": {
      "excludePlatforms": null,
      "includePlatforms": null
    },
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "userRiskLevels": [
      "high"
    ],
    "users": {
      "excludeGroups": [
        "P000",
        "E520"
      ],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [
        "P500"
      ],
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": null
        },
        "guestOrExternalUserTypes": null
      },
      "includeRoles": [],
      "includeUsers": []
    }
  },
  "createdDateTime": "2024-06-18T01:36:45.3338109Z",
  "description": null,
  "displayName": "520B-ServiceAccounts-IdentityProtection-AllResources-AnyPlatform-BlockHighUserRisk",
  "grantControls": {
    "authenticationStrength": {
      "allowedCombinations": null,
      "combinationConfigurations": null,
      "createdDateTime": null,
      "description": null,
      "displayName": null,
      "id": null,
      "modifiedDateTime": null,
      "policyType": null,
      "requirementsSatisfied": null
    },
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "id": "553246a4-db7f-4b9a-889f-4cef1e010503",
  "modifiedDateTime": null,
  "sessionControls": {
    "applicationEnforcedRestrictions": {
      "isEnabled": null
    },
    "cloudAppSecurity": {
      "cloudAppSecurityType": null,
      "isEnabled": null
    },
    "disableResilienceDefaults": null,
    "persistentBrowser": {
      "isEnabled": null,
      "mode": null
    },
    "signInFrequency": {
      "authenticationType": null,
      "frequencyInterval": null,
      "isEnabled": null,
      "type": null,
      "value": null
    }
  },
  "state": "enabledForReportingButNotEnforced",
  "templateId": null,
  "additionalProperties": {}
}
